run/randomProcessPerfCorr/rectangularCavityPar/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00001;

boundaryField
{
    
    frontAndBack
    {
        type            empty;
      
    }

    inlet
    {
        type            fixedValue;
        value           uniform 0.00001;
    }

    outlet
    {
        type            zeroGradient;

    }

    topAndBottom
    {
        type            slip;
    }

    defaultFaces
    {
        type            empty;
    }

}

// ************************************************************************* //
